{
  "main": {
    "name": "Derek Etherton",
    "occupation": "developer",
    "description": "Developer. Go player (圍棋). Voracious learner, always eager for a new challenge.",
    "image": "headshot.jpg",
    "bio": "I'm an ambitious developer with strong initiative and a knack for killer demos. A solid foundation in software design, algorithms, data structures, and a variety of programming paradigms makes me a quick learner comfortable working with most modern technology. Two years of working in Android helped me develop strong Java & object-oriented fundamentals, which I've further improved working with Spring at RBC. I've spent thousands of hours on the web basics (ES6, HTML5, SCSS), received training in Angular 7 and have also built sites using React & Node. In all pursuits I'm guided by SOLID principles, and keep a design patterns & code smells cheatsheet handy. Yes, I can build \"RESTful APIs\", and CI/CD is something I can't live without.",
    "contactmessage": "Here is where you should write your message to readers to have them get in contact with you.",
    "email": "derek.etherton@hotmail.com",
    "phone": "416-670-1905",
    "address": {
      "street": "902-980 Seymour St",
      "city": "Vancouver",
      "state": "British Columbia",
      "zip": "V6B 1B5"
    },
    "website": "http://www.etherton.com",
    "resumedownload": "http://www.etherton.com",
    "social": [
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/derek-etherton-b8b40085/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "github",
        "url": "http://github.com/derek-etherton",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "Through my education I have exposure to a swathe of programming languages: C, Haskell, and a lot of Python. The below skills include only those I've used in a professional capacity.",
    "education": [
      {
        "school": "University of Toronto Scarborough",
        "degree": "Honours B.Sc Computer Science (Specialist)",
        "graduated": "June 2018",
        "description": "On top of the solid fundamentals that U of T delivers in Computer Science, I was in the first cohort of 10-15 students to enroll in UTSC's Entrepreneurship Specialist stream. With the same stringent requirements of Software Engineering, we had the added benefit of taking a hands-on startup course focused on prototyping a new product in an Agile environment with weekly pitches and demos. Learned more about algorithm design & analysis, programming language fundamentals, and software design than is healthy."
      }
    ],
    "work": [
      {
        "company": "RBC",
        "title": "Developer",
        "years": "January 2019 - September 2020",
        "description": "As a member of the small Marketing & Citizenship IT team I lead development on an award-winning Financial Literacy course which far-exceeded business expectations with over 100k registrants in its first year. The course was developed using vanilla web technology (+Bootstrap), and parts were built on top of a vendor Learning Management System. I displayed outstanding dedication and ability to lead while coordinating dev efforts across disciplines to ship this product on time. At RBC, I've gotten comfortable following the SDLC and creating technical documents, while also helping my team to refine their Agile practices. Across our many projects, I helped re-design and develop an Angular/ElasticSearch reporting dashboard, built out essential report automation using Spring Batch, and worked frequently with Pivotal Cloud Foundry (PCF) and Enterprise Jenkins."
      },
      {
        "company": "Freelance Contract",
        "title": "Android Developer",
        "years": "October 2016 - June 2018",
        "description": "Took over a previous contractor's work on an Android kiosk & app for the tourism industry which displays rich 3D map content based on map data pulled from AWS. Applied Material Design principles with fluid, realistic movement."
      },
      {
        "company": "Parks Canada",
        "title": "Android Developer",
        "years": "May 2016 - December 2016",
        "description": "Created ‘The Rouge’, an app for Canada’s first national urban park, leveraging location services. Features dynamic push notifications, analytics using Google Firebase, and serious performance after months of Espresso automated testing. 1000+ downloads."
      },
      {
        "company": "Centre for Addiction and Mental Health",
        "title": "Android Developer",
        "years": "September 2015 - December 2015",
        "description": "Created a location-aware scheduling application with researchers to aid in the treatment of schizophrenia."
      }
    ],
    "skills": [
      {
        "name": "ES6 (Javascript)",
        "level": "90%"
      },
      {
        "name": "Node JS",
        "level": "80%"
      },
      {
        "name": "Java Spring",
        "level": "70%"
      },
      {
        "name": "Angular",
        "level": "60%"
      },
      {
        "name": "Android (Native)",
        "level": "60%"
      },
      {
        "name": "ElasticSearch",
        "level": "50%"
      },
      {
        "name": "React",
        "level": "50%"
      },
      {
        "name": "HTML5",
        "level": "90%"
      },
      {
        "name": "SQL",
        "level": "85%"
      },
      {
        "name": "SCSS",
        "level": "70%"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "McGill Personal Finance Essentials",
        "category": "A financial literacy course I lead development for at RBC",
        "image": "mpfe.jpg",
        "url": "https://www.mcgillpersonalfinance.com"
      },
      {
        "title": "The Rouge",
        "category": "Rouge National Urban Park's official app, developed w/ 3 other students at Parks Canada",
        "image": "therouge1.jpg",
        "url": "https://play.google.com/store/apps/details?id=com.rouge.Rouge_App&hl=en_CA"
      },
      {
        "title": "Boonmaps",
        "category": "3D interactive maps for outdoor adventurers, I built out most of this Android app on contract over a two-year period. The app supports large screens for use in tourist centers.",
        "image": "mtns.jpg",
        "url": "https://www.boonmaps.com/index.html"
      }
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "Here you should write some nice things that someone has said about you. No lies though, employers can tell when you are lying.",
        "user": "Kareem Abdul Jabbar"
      },
      {
        "text": "That Tim Baker must be one of the most brilliant developers I've ever met! It is amazing that nobody has hired him yet. Hey you, you should hire this guy, he may be fresh out of University and have zero on the job experience but I am confident that he will be one of your best developers in no time!",
        "user": "Steve Wozniak... impersonator"
      }
    ]
  }
}
